#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.web: Reading...[0m[0m
[0m[1mdata.aws_security_group.app: Reading...[0m[0m
[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1mdata.aws_security_group.data: Reading...[0m[0m
[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1mdata.aws_security_group.web: Reading...[0m[0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Reading...[0m[0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Read complete after 0s [id=Z10207542GS9DRXRUX91S][0m
[0m[1mdata.aws_subnets.web: Read complete after 0s [id=ca-central-1][0m
[0m[1mdata.aws_subnets.data: Read complete after 0s [id=ca-central-1][0m
[0m[1mdata.aws_subnets.app: Read complete after 0s [id=ca-central-1][0m
[0m[1mdata.aws_security_group.web: Read complete after 0s [id=sg-09ac571e9bacb12da][0m
[0m[1mdata.aws_security_group.app: Read complete after 0s [id=sg-0878a48c1cdda6aa6][0m
[0m[1mdata.aws_security_group.data: Read complete after 0s [id=sg-05f32ed700a41ccac][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_acm_certificate.ga_certificate[0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate" "ga_certificate" {
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m domain_name               = (sensitive value)
      [32m+[0m[0m domain_validation_options = [
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "issue-7.ga-dev.bac-lac.ca"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
        ]
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m key_algorithm             = (known after apply)
      [32m+[0m[0m not_after                 = (known after apply)
      [32m+[0m[0m not_before                = (known after apply)
      [32m+[0m[0m pending_renewal           = (known after apply)
      [32m+[0m[0m renewal_eligibility       = (known after apply)
      [32m+[0m[0m renewal_summary           = (known after apply)
      [32m+[0m[0m status                    = (known after apply)
      [32m+[0m[0m subject_alternative_names = [
          [32m+[0m[0m "issue-7.ga-dev.bac-lac.ca",
        ]
      [32m+[0m[0m tags_all                  = (known after apply)
      [32m+[0m[0m type                      = (known after apply)
      [32m+[0m[0m validation_emails         = (known after apply)
      [32m+[0m[0m validation_method         = "DNS"
    }

[1m  # aws_acm_certificate_validation.ga_certificate_validation[0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate_validation" "ga_certificate_validation" {
      [32m+[0m[0m certificate_arn         = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m validation_record_fqdns = (known after apply)
    }

[1m  # aws_alb_listener.ga_443[0m will be created
[0m  [32m+[0m[0m resource "aws_alb_listener" "ga_443" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m certificate_arn   = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 443
      [32m+[0m[0m protocol          = "HTTPS"
      [32m+[0m[0m ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      [32m+[0m[0m tags_all          = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }
    }

[1m  # aws_alb_listener.http_80[0m will be created
[0m  [32m+[0m[0m resource "aws_alb_listener" "http_80" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags_all          = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order = (known after apply)
          [32m+[0m[0m type  = "redirect"

          [32m+[0m[0m redirect {
              [32m+[0m[0m host        = "#{host}"
              [32m+[0m[0m path        = "/#{path}"
              [32m+[0m[0m port        = "443"
              [32m+[0m[0m protocol    = "HTTPS"
              [32m+[0m[0m query       = "#{query}"
              [32m+[0m[0m status_code = "HTTP_301"
            }
        }
    }

[1m  # aws_alb_target_group.ga_tg[0m will be created
[0m  [32m+[0m[0m resource "aws_alb_target_group" "ga_tg" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = (known after apply)
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancer_arns                 = (known after apply)
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_anomaly_mitigation  = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = (sensitive value)
      [32m+[0m[0m name_prefix                        = (known after apply)
      [32m+[0m[0m port                               = 80
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags_all                           = (known after apply)
      [32m+[0m[0m target_type                        = "ip"
      [32m+[0m[0m vpc_id                             = (sensitive value)

      [32m+[0m[0m health_check {
          [32m+[0m[0m enabled             = true
          [32m+[0m[0m healthy_threshold   = 3
          [32m+[0m[0m interval            = 30
          [32m+[0m[0m matcher             = "200,302"
          [32m+[0m[0m path                = "/"
          [32m+[0m[0m port                = "traffic-port"
          [32m+[0m[0m protocol            = "HTTP"
          [32m+[0m[0m timeout             = (known after apply)
          [32m+[0m[0m unhealthy_threshold = 3
        }

      [32m+[0m[0m stickiness {
          [32m+[0m[0m cookie_duration = 86400
          [32m+[0m[0m enabled         = true
          [32m+[0m[0m type            = "lb_cookie"
        }
    }

[1m  # aws_db_instance.ga_mysql[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "ga_mysql" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = (known after apply)
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = (known after apply)
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m db_name                               = (sensitive value)
      [32m+[0m[0m db_subnet_group_name                  = (sensitive value)
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "mysql"
      [32m+[0m[0m engine_version                        = "8.0.35"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = (known after apply)
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = (known after apply)
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = (known after apply)
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "default.mysql8.0"
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = (known after apply)
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = true
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags_all                              = (known after apply)
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (sensitive value)
      [32m+[0m[0m vpc_security_group_ids                = [
          [32m+[0m[0m "sg-05f32ed700a41ccac",
        ]
    }

[1m  # aws_db_subnet_group.data[0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "data" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "Managed by Terraform"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = (sensitive value)
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m subnet_ids              = [
          [32m+[0m[0m "subnet-018e79860706a7725",
          [32m+[0m[0m "subnet-0a812e746fab22dc2",
        ]
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags_all                = (known after apply)
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1m  # aws_ecs_cluster.ga_cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "ga_cluster" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m name     = (sensitive value)
      [32m+[0m[0m tags_all = (known after apply)

      [32m+[0m[0m setting {
          [32m+[0m[0m name  = "containerInsights"
          [32m+[0m[0m value = "enabled"
        }
    }

[1m  # aws_ecs_cluster_capacity_providers.ga_cluster_capacity_providers[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster_capacity_providers" "ga_cluster_capacity_providers" {
      [32m+[0m[0m capacity_providers = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m cluster_name       = (sensitive value)
      [32m+[0m[0m id                 = (known after apply)
    }

[1m  # aws_ecs_service.ga_service[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_service" "ga_service" {
      [32m+[0m[0m cluster                            = (known after apply)
      [32m+[0m[0m deployment_maximum_percent         = 200
      [32m+[0m[0m deployment_minimum_healthy_percent = 100
      [32m+[0m[0m desired_count                      = 1
      [32m+[0m[0m enable_ecs_managed_tags            = false
      [32m+[0m[0m enable_execute_command             = false
      [32m+[0m[0m iam_role                           = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m launch_type                        = "FARGATE"
      [32m+[0m[0m name                               = (sensitive value)
      [32m+[0m[0m platform_version                   = "LATEST"
      [32m+[0m[0m scheduling_strategy                = "REPLICA"
      [32m+[0m[0m tags_all                           = (known after apply)
      [32m+[0m[0m task_definition                    = (known after apply)
      [32m+[0m[0m triggers                           = (known after apply)
      [32m+[0m[0m wait_for_steady_state              = false

      [32m+[0m[0m load_balancer {
          [32m+[0m[0m container_name   = "mft1"
          [32m+[0m[0m container_port   = 8000
          [32m+[0m[0m target_group_arn = (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [32m+[0m[0m network_configuration {
          [32m+[0m[0m assign_public_ip = false
          [32m+[0m[0m security_groups  = [
              [32m+[0m[0m "sg-0878a48c1cdda6aa6",
            ]
          [32m+[0m[0m subnets          = [
              [32m+[0m[0m "subnet-012542a6eb687c5f0",
              [32m+[0m[0m "subnet-0e7eb644778bb567f",
            ]
        }
    }

[1m  # aws_ecs_task_definition.ga_task_definition[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "ga_task_definition" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m arn_without_revision     = (known after apply)
      [32m+[0m[0m container_definitions    = jsonencode(
            [
              [32m+[0m[0m {
                  [32m+[0m[0m cpu              = 0
                  [32m+[0m[0m environment      = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "CLUSTER_PORT"
                          [32m+[0m[0m value = "8006"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "DB_PASSWORD"
                          [32m+[0m[0m value = "DB_PASSWORD"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "DB_URL"
                          [32m+[0m[0m value = "DB_URL"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "DB_USERNAME"
                          [32m+[0m[0m value = "GADATA"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "MFT_CLUSTER"
                          [32m+[0m[0m value = "TRUE"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "SYSTEM_NAME"
                          [32m+[0m[0m value = "MFT-1"
                        },
                    ]
                  [32m+[0m[0m essential        = true
                  [32m+[0m[0m healthCheck      = {
                      [32m+[0m[0m command     = [
                          [32m+[0m[0m "CMD-SHELL",
                          [32m+[0m[0m "curl -f http://localhost:8000/ || exit 1",
                        ]
                      [32m+[0m[0m interval    = 30
                      [32m+[0m[0m retries     = 3
                      [32m+[0m[0m startPeriod = 120
                      [32m+[0m[0m timeout     = 5
                    }
                  [32m+[0m[0m image            = "211125753903.dkr.ecr.ca-central-1.amazonaws.com/mft"
                  [32m+[0m[0m logConfiguration = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-create-group  = "true"
                          [32m+[0m[0m awslogs-group         = "/ecs/ga-td"
                          [32m+[0m[0m awslogs-region        = "ca-central-1"
                          [32m+[0m[0m awslogs-stream-prefix = "ecs"
                        }
                    }
                  [32m+[0m[0m mountPoints      = [
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/userdata/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_userdata"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/sharedconfig/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_sharedconfig"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/opt/HelpSystems/GoAnywhere/upgrader/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_upgrader1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/config/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_config1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/tomcat/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_tomcatserver1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/opt/HelpSystems/GoAnywhere/tomcat/logs/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_tomcatlog1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/opt/HelpSystems/GoAnywhere/ghttpsroot/custom/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_ghttpsroot1"
                        },
                    ]
                  [32m+[0m[0m name             = "mft1"
                  [32m+[0m[0m portMappings     = [
                      [32m+[0m[0m {
                          [32m+[0m[0m appProtocol   = "http"
                          [32m+[0m[0m containerPort = 8000
                          [32m+[0m[0m name          = "mft1-8000-tcp"
                          [32m+[0m[0m protocol      = "tcp"
                        },
                    ]
                  [32m+[0m[0m systemControls   = []
                  [32m+[0m[0m volumesFrom      = []
                },
            ]
        )
      [32m+[0m[0m cpu                      = "1024"
      [32m+[0m[0m execution_role_arn       = (sensitive value)
      [32m+[0m[0m family                   = (sensitive value)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m memory                   = "3072"
      [32m+[0m[0m network_mode             = "awsvpc"
      [32m+[0m[0m requires_compatibilities = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m revision                 = (known after apply)
      [32m+[0m[0m skip_destroy             = false
      [32m+[0m[0m tags_all                 = (known after apply)
      [32m+[0m[0m track_latest             = false

      [32m+[0m[0m runtime_platform {
          [32m+[0m[0m cpu_architecture        = "X86_64"
          [32m+[0m[0m operating_system_family = "LINUX"
        }

      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_config1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_ghttpsroot1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_sharedconfig"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_tomcatlog1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_tomcatserver1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_upgrader1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_userdata"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_config1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_config1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "config1-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/config1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_config2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_config2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "config2-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/config2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_ghttpsroot1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_ghttpsroot1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "ghttpsrootoot1-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/ghttpsroot1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_ghttpsroot2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_ghttpsroot2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "ghttpsrootoot2-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/ghttpsroot2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_root[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_root" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "root-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_sharedconfig[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_sharedconfig" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "sharedconfig-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/sharedconfig"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatlog1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatlog1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatlog1-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatlog1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatlog2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatlog2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatlog2-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatlog2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatserver1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatserver1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatserver1-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatserver1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatserver2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatserver2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatserver2-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatserver2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_upgrader1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_upgrader1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "upgrader1-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/upgrader1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_upgrader2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_upgrader2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "upgrader2-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/upgrader2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_userdata[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_userdata" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "userdata-issue-7"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/userdata"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_file_system.ga_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_file_system" "ga_efs" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m availability_zone_id    = (known after apply)
      [32m+[0m[0m availability_zone_name  = (known after apply)
      [32m+[0m[0m creation_token          = (sensitive value)
      [32m+[0m[0m dns_name                = (known after apply)
      [32m+[0m[0m encrypted               = true
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m kms_key_id              = (known after apply)
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m number_of_mount_targets = (known after apply)
      [32m+[0m[0m owner_id                = (known after apply)
      [32m+[0m[0m performance_mode        = (known after apply)
      [32m+[0m[0m size_in_bytes           = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Name" = "ga-issue-7-efs"
        }
      [32m+[0m[0m throughput_mode         = "elastic"
    }

[1m  # aws_efs_mount_target.ga_efs_mount_target_1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "ga_efs_mount_target_1" {
      [32m+[0m[0m availability_zone_id   = (known after apply)
      [32m+[0m[0m availability_zone_name = (known after apply)
      [32m+[0m[0m dns_name               = (known after apply)
      [32m+[0m[0m file_system_arn        = (known after apply)
      [32m+[0m[0m file_system_id         = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip_address             = (known after apply)
      [32m+[0m[0m mount_target_dns_name  = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m security_groups        = [
          [32m+[0m[0m "sg-0878a48c1cdda6aa6",
        ]
      [32m+[0m[0m subnet_id              = "subnet-012542a6eb687c5f0"
    }

[1m  # aws_efs_mount_target.ga_efs_mount_target_2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "ga_efs_mount_target_2" {
      [32m+[0m[0m availability_zone_id   = (known after apply)
      [32m+[0m[0m availability_zone_name = (known after apply)
      [32m+[0m[0m dns_name               = (known after apply)
      [32m+[0m[0m file_system_arn        = (known after apply)
      [32m+[0m[0m file_system_id         = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip_address             = (known after apply)
      [32m+[0m[0m mount_target_dns_name  = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m security_groups        = [
          [32m+[0m[0m "sg-0878a48c1cdda6aa6",
        ]
      [32m+[0m[0m subnet_id              = "subnet-0e7eb644778bb567f"
    }

[1m  # aws_lb.ga_lb[0m will be created
[0m  [32m+[0m[0m resource "aws_lb" "ga_lb" {
      [32m+[0m[0m arn                                                          = (known after apply)
      [32m+[0m[0m arn_suffix                                                   = (known after apply)
      [32m+[0m[0m desync_mitigation_mode                                       = "defensive"
      [32m+[0m[0m dns_name                                                     = (known after apply)
      [32m+[0m[0m drop_invalid_header_fields                                   = false
      [32m+[0m[0m enable_deletion_protection                                   = false
      [32m+[0m[0m enable_http2                                                 = true
      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers                  = false
      [32m+[0m[0m enable_waf_fail_open                                         = false
      [32m+[0m[0m enable_xff_client_port                                       = false
      [32m+[0m[0m enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      [32m+[0m[0m id                                                           = (known after apply)
      [32m+[0m[0m idle_timeout                                                 = 60
      [32m+[0m[0m internal                                                     = true
      [32m+[0m[0m ip_address_type                                              = (known after apply)
      [32m+[0m[0m load_balancer_type                                           = "application"
      [32m+[0m[0m name                                                         = (sensitive value)
      [32m+[0m[0m name_prefix                                                  = (known after apply)
      [32m+[0m[0m preserve_host_header                                         = false
      [32m+[0m[0m security_groups                                              = [
          [32m+[0m[0m "sg-09ac571e9bacb12da",
        ]
      [32m+[0m[0m subnets                                                      = [
          [32m+[0m[0m "subnet-0503aa6bf2f9c1701",
          [32m+[0m[0m "subnet-076671c51253def2e",
        ]
      [32m+[0m[0m tags                                                         = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = (sensitive value)
        }
      [32m+[0m[0m tags_all                                                     = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "ga-issue-7-lb"
        }
      [32m+[0m[0m vpc_id                                                       = (known after apply)
      [32m+[0m[0m xff_header_processing_mode                                   = "append"
      [32m+[0m[0m zone_id                                                      = (known after apply)

      [32m+[0m[0m access_logs {
          [32m+[0m[0m enabled = false
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # aws_route53_record.ga_record_a[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "ga_record_a" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (sensitive value)
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = true
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # aws_route53_record.ga_record_cname["issue-7.ga-dev.bac-lac.ca"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "ga_record_cname" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = (known after apply)
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # aws_route53_record.ga_record_ns[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "ga_record_ns" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (sensitive value)
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 172800
      [32m+[0m[0m type            = "NS"
      [32m+[0m[0m zone_id         = "Z10207542GS9DRXRUX91S"
    }

[1m  # aws_route53_zone.ga_zone[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_zone" "ga_zone" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m comment             = "Managed by Terraform"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = (sensitive value)
      [32m+[0m[0m name_servers        = (known after apply)
      [32m+[0m[0m primary_name_server = (known after apply)
      [32m+[0m[0m tags_all            = (known after apply)
      [32m+[0m[0m zone_id             = (known after apply)
    }

[1mPlan:[0m 32 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*